In [1]:
import pandas as pd
import numpy as np

In [8]:
dframe1 = pd.DataFrame({'key':['X','Z','Y','Z','X','X'],
                       'data_set_1':np.arange(6)})

In [9]:
dframe1

   data_set_1 key
0           0   X
1           1   Z
2           2   Y
3           3   Z
4           4   X
5           5   X

In [12]:
dframe2 = pd.DataFrame({'key':['Q','Z','Y'],
                       'data_set_2':np.arange(3)})

In [13]:
dframe2

   data_set_2 key
0           0   Q
1           1   Z
2           2   Y

In [14]:
pd.merge(dframe1, dframe2)

   data_set_1 key  data_set_2
0           1   Z           1
1           3   Z           1
2           2   Y           2

In [15]:
pd.merge(dframe1, dframe2, on='key', how='left')

   data_set_1 key  data_set_2
0           0   X         NaN
1           1   Z         1.0
2           2   Y         2.0
3           3   Z         1.0
4           4   X         NaN
5           5   X         NaN

In [16]:
pd.merge(dframe1, dframe2, on='key', how='right')

   data_set_1 key  data_set_2
0         1.0   Z           1
1         3.0   Z           1
2         2.0   Y           2
3         NaN   Q           0